Show / Hide Table of Contents
Class OriginSettings
OriginProject
Inheritance
System.Object
OpenObject
OriginSettings
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
public class OriginSettings : OpenObject
Constructors
Improve this Doc   View Source
OriginSettings()
Constructor
Declaration
public OriginSettings()
Properties
Improve this Doc   View Source
Author
Name of author of project
Declaration
public string Author { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
CountryCode
CountryCode
Declaration
public CountryCode CountryCode { get; set; }
Property Value
 Type |  Description
 CountryCode
Improve this Doc   View Source
CrossSectionConversionTable
Conversion table for Parameters
Declaration
public CrossSectionConversionTable CrossSectionConversionTable { get; set; }
Property Value
 Type |  Description
 CrossSectionConversionTable
Improve this Doc   View Source
DateOfCreate
Date of create project
Declaration
public DateTime DateOfCreate { get; set; }
Property Value
 Type |  Description
 System.DateTime
Improve this Doc   View Source
CheckEquilibrium
All loads have to be in equilibrium
Declaration
public bool CheckEquilibrium { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
ImportRecommendedWelds
Import also recommended welds
Declaration
public bool ImportRecommendedWelds { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
ProjectDescription
Description of project
Declaration
public string ProjectDescription { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
ProjectName
Name of project
Declaration
public string ProjectName { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source